// 1)შექმენი ცვლადი რომელშც შეინახავ ნებისმიერ ათწილად რიცხვს

// შენი დავალებაა:
let ll = 2.5
// დაამრგვალო ეს ათწილადი უახლახლოეს მთელ რიცხვამდე
console.log(Math.round(ll))
// დაამრგვალო ეს ათწილადი ზემოთ მყოფ მთელამდე
console.log(Math.ceil(ll))
// დაამრგვალო ეს ათწილად ქვემოთ მყოფ მთელამდე
console.log(Math.floor(ll))
// და გამოიტანო მთელი ამ ათწილადი რიცხვისა
console.log(Math.trunc(ll))
// ყველაფერი გამოიტანეთ კონსოლში'
console.log(Math.sign(ll))
// 2)აიყვანე რიცხვი 3 რიცხვი 5 ის ხარისხში
console.log(Math.pow(2 , 5))
console.log(Math.pow(4 , 5))
console.log(Math.pow(947 , 5))
// 3)ამოიღე ფესვი 81 დან და დაბეჭდე შედეგი
console.log(Math.sqrt(81))
// 4)გადააქციე  უარყოფითი რიცხვი დადებით რიცხვად
console.log(Math.abs(ll))
// 5)იპოვე რაიმე 5 რიცხვიდან იმცირესი
console.log(Math.min(9438, 729 , 30 , 94))
// 6)იპოვე რაიმე 5 რიცხვიდან უდიდესი
console.log(Math.max(9438, 729 , 30 , 94))
// 7)დააგენერირე რაიმე რენდომ რიცხვი
console.log(Math.random())