// 1)კომენტარის სახით ახსენით თუ რა არის .length 
// length aris rogorc len in python  is gviCvenebs sigrZes

let str = "hello";
console.log(str.length)
// დაბეჭდე რამდენი სიმბოლოა

// 3)შექმენი ცვლადი სამივე keyword ის გამოყენებით,შენი დავალებაა დაბეჭდო სამივე ცვლადში შენახული სიმბოლოების ჯამი(გამოიყენე .length და მათემატიკური ოპერატორი)
let one = "1"
var two = "22"
const three = "333"
console.log(one.length + two.length + three.length)
// 4)შექმენი ორი ერთში შეინახე სახელი მეორეში გვარი ,შემდეგ მოახდინე კონკატინაცია,გამოიყენე string interoplation და ბოლოს დაბეჭდე ამ მთლიანი სტრინგის სიგრძე
let m = "mero"
let n =" gaganidze "

console.log(`${m},${n}`.length)
// 5)შექმენი ცვლადი let ის გამოყენებითდა შეინახე შენი სახელი,შემდეგ განაახლე ცვლადის მნიშნველბა და მიანიჭე მას "nika" დაბეჭდე საბოლოო შედეგი
let mi = "mero"
mi = "nika"
// 6)შექმენი ცვლადი var ის გამოყენებითდა შეინახე შენი სახელი,შემდეგ განაახლე ცვლადის მნიშნველბა და მიანიჭე მას "giorgi" დაბეჭდე საბოლოო შედეგი
var mil = "mero"
mil = "giorgi"
// 7)შექმენიც ცვლადი const ის გამოყენებით,შემდეგ შეცვალე მისი მნიშვნელობა ,რატომ არ შეცვალა მნიშვნელობა?
// radgan SeuZlebelia
// 8)შექმენი ცვლადი let ის გამოყენებით და შიგნით არაფერი შეინახო,ამის შემდეგ სამჯერ განაახლე ამ ცვლადის მნიშნველობა,დაბეჭდე საბოლოო შედეგი
let g
g="ll"
g ="llia"
// 9)შექმენი ცვლადი var ის გამოყენებით და შიგნით არაფერი შეინახო,ამის შემდეგ სამჯერ განაახლე ამ ცვლადის მნიშნველობა,დაბეჭდე საბოლოო შედეგი
var p
p="il"
p="llia"
// 10)შექმენი ცვლადი სამივე keyword ის გამოყენებით და შიგნით არაფერი შეიანხო,დაბეჭდე თითოეული მათგანი და ნახე რას მოგცემს თითოეული პასუხად
var p
const p
let p

// 11)შექმენი 4 ცვლადი let ის გამოყენებით,
let name = "merabi"
let surname = "gaganidze"
let age = 11
let adress = "kutaisi"
// 1)name
// 2)surname
// 3)age
// 4)adress

// გამოიტანე შემდეგნაირი ტექსტი : hello,my name is ... ,my surname is ... and my age is ... age , i live in ... . 
console.log(`hello, my name is ${name},my surname is ${surname} and my age is ${age} age , i live in ${adress}` )
// სამი წერტილის მაგივრად უნდა ჩასვათ ცვლადის მნიშვნელობები,გამოიყენეთ string interpolation --> `...${}...`

// 12)რას აკეთებს თითოეული მათგანია ახსენით:+= -= *== /= ++ --
// 1.mivumatot 2.gavarmravlot 3.gamovaklot  gamravleba gakofa. ertri plus .erti minus

// 12)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაზარდე ამ ცვლადის მნიშვნელობა 5 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი 
let number1 = 1
number += 5
console.log(number)

// 13)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ შეამცირე ამ ცვლადის მნიშვნელობა 3 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი

// 14)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ შეამცირე ამ ცვლადის მნიშვნელობა 3 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი

// 15)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაამრავლე ამ ცვლადის მნიშვნელობა 6 ზე(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი

// 16)შექმენი ცვლადის სადაც შეინახავ number ტიპის მონაცემს,შემდეგ გაყავი ამ ცვლადის მნიშვნელობა 2 ზე(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი

// 17)შექმენი ცვლადი და შეინახე რიცხვი,შენი დავალებაა შესაბამისი ოპერატორით გაზარდო ამ ცვლადის მნშვნელობა 1 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი

// 18)შექმენი ცვლადი და შეინახე რიცხვი,შენი დავალებაა შესაბამისი ოპერატორით შეამცირო ამ ცვლადის მნშვნელობა 1 ით(გამოიყენე შესაბამისი ოპერატორი),დაბეჭდე ცვლადი რომ ნახო შედეგი