// 1)შექმენით ფუნქცია, რომელსაც გადაეცემა 2 რიცხვი, შემდეგ ამ პირველი რიცხვიდან მეორე რიცხვამდე გამოიტანეთ მარტო 3 ის ჯერადი რიცხვები
function lili(num1,num2){
    for (let i = num1;i<num2;i+=3){ 
         console.log(i)}
    }
lili(5,45)
// 2)შექმენით ფუქნცია რომელსაც გადაეცემა  3 რიცხვი, შემდე პირველი რიცხვიდან მესამე  რიცხვამდე გამოიტანეთ ყველა მეორე რიცხვის ჯერადი (ჩახლართული პირობა  :)) )
function lil2(num1,num2,num3){
    for (let i = num1;i<num2;i+=num3){    console.log(i)}
    
}
lil2(5,45,4)
// 3)შექმენით ფუნქცია რომელსაც გადაეცეემა სტრინგი, შემდეგ ამ სტრინგში  მხოლოს 3 ის ჯერად ინდექსზე მდგომი ელემენტები გამოიტანეთ
function lil3(wordLegend){
    for(let i = 0;i < wordLegend;i+3){
    }
    console.log(i)
    }
lil3(giorgi)
// 4)შექმენით ფუნქცია რომელიც 1 დან არგუმენტად გადაცემულ რიცხვამდე გამოიტანს გაორმაგებულ რიცხვებს
function lil3(number){
    for(let i = 0;i < number;i+2){
    }
    console.log(i)
    }
lil(34)
// 5)მოიძიეთ ინფფორმაცია ჯს ის სიებზე :))