// მომხმარებელს შემოაყვანინეთ რაიმე სტრინგი
// შემდეგ შეამოწმეთ --> თუ ეს სტრინგი იწყება ასო "g" ზე --> და <-- ამ სტრინგის სიგრძე არის 6 ზე მეტიანტოლი დააკონსოლლოგე --> "იწყება ასოზე და არის გრძელი სიტყვა" 
// თუ ეს სტრინგი იწყება ასო "a" ზე და მისი გირძე ნაკლებია 6 ზე დააკონსოლლოგე ---> "იწყება ა ასოზე და არის მოკლე სიტყვა"
// სხვა შემთხვევაშ დაუკონსოლლოგე --> "ამოუცნობი სიტგვა"
let m = prompt(". . .")
if(m.startsWith("g") && m.length >=6){
    console.log("იწყება ასოზე და არის გრძელი სიტყვა" )
}

else if(m.startsWith("a") && m.length <6)
    console.log("იწყება ა ასოზე და არის მოკლე სიტყვა" )

else{
    console.log("ამოუცნობი სიტყვა")
}

// 2)მომხმარებელს შემოატანინე რაიმე რიცხვი

// თუ ეს რიცხვი მეტია 50 ზე ან არის ლუწი --> "more than 50 or even"

// hujvwioefjvhwoiehfvთუ ეს რიცხვი არის 50 ზე ნაკლები და არის კენტი --> less than 50 and odd"

// სხვა შემთხვევაში --> "other number"

let n = Number(prompt(". . ."))
if(n > 50 || n%2===0){
    console.log("more than 50 or even")
}

else if(n < 50 || n%2===1){
    console.log("more than 50 or even")
}

else{
    console.log("other number")
}