// 1)კომენტარის სახით ახსენით თუ რა არის console.log() და რაში ვიყენებთ მას
// console.log consolSi gamoitans... yvelafers

// 2)გამოიტანე კონსოლში შენი სახელი
console.log("merabi")
// 3)გამოიტანე კონსოლში შენი ასაკი
console.log(11)
// 4)გამოიტანე კონსოლში შენი სიმაღლე
console.log(1.70)
// 5)კომენტარის სახით ახსნით თუ რა არის ცვლადი და როგორ ვქმნით ცვლადებს ჯს ში
// cvladi aris yuti sadac inaxeba elementi is iqmneba let var the const it
// ჩამოწერე სამივე გზა 

// 6)კომენტარის სახით თუ რა განსხვავებაა const და დაანარჩენ ორ keyword ით შექმნილ ცვლადებს შორის
// const ar icvleba
// var Zvelia magram icvlba
// let icvleba
// 7)შექმენი ცვლადი სამივე ქივორდის გამოყენებით და შეინახე შენთვის სასურველი მნიშვნელობები
let mero = "merabii"
const age =134
var old = 250
// 8)შექმენი:

// string
// number
// boolean და თითოეული შეინახე ცვლადებში

// კონსოლში გამოიტანეთ თითოეული გამოიტანე
let boolasduck = true
let stringasduck = "mero"
let numbersaduck = 20
// 9)შექმენი ორი ცვლადი და შეინახე რიცვები და შეასრულე და თან დააკონსოლლოგე ამ ორ რიცხვზე:
// შეკრება
// გამოკლება
// გამრავლება
// გაყოფა
let num1 = 4 
let num2 = 2 
console.log(num1 + num2)
console.log(num1 - num2)
console.log(num1 * num2)
console.log(num1 % num2)

// 10)იპოვე ზემოთ დავალებაში მოცემული რიცხვებისგაყოფისას მიღებული ნაშთი
1
// 11)მოიყვანეთ სამ სამი მაგალითი ყველა მათემატიკურ ოპერატორზე რაც ვისწავლეთ

// 12)შექმენი ორი ცვლადი: firstName, lastName
// შეაერთე და გამოიტანე სრული სახელი


// 13)შექმნეი ცვლადი სახელად name1 და შენიახე შენი სახელი

// დაამატე ტექსტი თან გამოიტანე კონსოლში:

// "მე მქვია " + name1