// 1)შექმენით ფუნქცია რომელიც კონსოლში გამოიტანს ინფორმაციას შენს შესახებ
function one(){
    console.log("gamarjoba me var merabi,miyvars programireba da ver vnaxe kargi fasi sawidao manekenisTvis")
}
// 2)შექმენი ფუნქცია რომელიც ორ რიცხვს დაუმატებს ერთმანეთს და დააკონსოლლოგებს
function one1(){
    console.log(1+8705382)

}
// 3)შექმენი ფუქნცია რომელიც კონსოლში გამოიტანს რაიმე მესიჯს თქვენი მომხმარებლისთვის

// ფუნქცია გამოიძახე 5 ჯერ (ვითომ 5 მომხმარებელს უგზავნით რაიმე მესიჯს)
function one2(){
    console.log("მომისმინე")

}

one1()
one1()
one1()
one1()
one1()

// 4) შექმენით ფუნქცია რომელსად პარამეტრად გადაეცემა შემდეგი ცვლადები num1 , num2 , num3

// შენი დავალებააფუნქციამ კონსოლში გამოიტანოს ამ სამი რიცხვის ნამრავლი

// გამოიძახე ფუნქცია ოთხჯერ ოღონდ განსხვავებული არგუმენტებით
function one3(n1,n2,n3){
    console.log(n1*n2*n3)

}

one3(1,2,3)
one3(6,24,33)
one3(14,23,35)
one3(31,25,377)
// 5)შექმენი ფუნქცია და გადაეცი ერთი არგუმენტი --> name

// ფუნქციამ უნდა დააკონსოლლოგოს ამ სახელის სიგრძე

// გამოძახე ფუნქცია 3 ჯერ სხვადასხვა სახელებით
function one3(name1){
    console.log(name1.length)

}

one3("l")
one3("k")
one3("m")
