// 1)მომხმარებელს შემოაყვანინეთ რაიმე რიცხვი

// შენი დავალებაა შეამოწმო ტერნარით --> თუ ეს რიცხვი არის ლუწი გამოიტანეთ --> "even" სხვა შემთხვევაშ გამოიტანეთ "odd"
let m = Number(prompt(""))
m % 2 === 0?console.log("even"):console.log("odd")
// 2)მომხმარებელს შემოატანინე რაიმე სტრინგი,შემდეგ შეამოწმე თ ამ სტრინგის სიგრძე მეტია 5 ზე გამოიტანე --> "big string" სხ ვა შემთხვევაში "short string"

let m1 = prompt("")
m1.length > 5?console.log("big string"):console.log("short string")
// -----
// 3) შექმენი ცვლადი სადაც შეინახავ რაიმე რიცხვს
let m2 = 2
// შემდეგ switch ის დახმარებით შეამოწმე
switch (m2){
// თუ ცვლადში შენახული მნშვნელობა არის 1 --> დალოგე --> ორშაბათი
    case 1:
        console.log("monday")
        break
// თუ ცვლადში შენახული მნშვნელობა არის 2 --> დალოგე --> სამშაბათი
    case 2:
        console.log("tuesday")
        break
// თუ ცვლადში შენახული მნშვნელობა არის 3 --> დალოგე --> ოთხშაბათი
    case 3:
        console.log("wednesday")
            
        break
// თუ ცვლადში შენახული მნშვნელობა არის 4 --> დალოგე --> ხუთშაბათი
    case 4:
        console.log("thursday")
            
        break
// თუ ცვლადში შენახული მნშვნელობა არის 5 --> დალოგე --> პარასკევი
    case 5:
        console.log("friday")
            
        break
// თუ ცვლადში შენახული მნშვნელობა არის 6 --> დალოგე --> შაბათი
    case 6:
        console.log("saturday")
            
        break
// თუ ცვლადში შენახული მნშვნელობა არის 7 --> დალოგე --> კვირა
    case 7:
        console.log("sunday")
            
        break
// სხვა შემთხვევაში დალოგე --> ასეთი კვირის დღე არ არსებობს
    default:
        console.log("ასეთი კვირის დღე არ არსებობს")

}


