// 1)მომხმარებელს შემოატანინე პაროლი prompt()-ით.
// თუ:
// პაროლი trim() შემდეგ იწყება "GOA"-თი
// და მისი სიგრძე (length) მეტია 10-ზე
// და მთლიანად uppercase არ არის

// დაბეჭდე: "Strong password"
// სხვა შემთხვევაში: "Weak password"
let m = prompt(". . .")
if(m.trim().startsWith("GOA") && ){
    console.log("იწყება ასოზე და არის გრძელი სიტყვა")
}

else if(m.startsWith("a") && m.length <6)
    console.log("იწყება ა ასოზე და არის მოკლე სიტყვა" )

else{
    console.log("ამოუცნობი სიტყვა")
}

// 2)მომხმარებელს შემოატანინე ასაკი და სახელი.
// თუ:
// ასაკი მეტია 18-ზე
// და სახელი იწყება "g"-ზე

// თუ ასაკი 18-ზე ნაკლებია → "Too young"

// სხვა შემთხვევაში → "Wrong username"

// 3)მომხმარებელს შემოატანინე ტექსტი.
// შეამოწმე:
// არის თუ არა ტიპი (typeof) string და
// აქვს თუ არა მინიმუმ 5 სიმბოლო
// და იწყება თუ არა "hello"-თი 

// თუ ყველა პირობა შესრულდა → "Valid text"

// სხვა შემთხვევაში → "Invalid text"


// 4)მომხმარებელს შემოატანინე ორი სიტყვა.
// თუ:
// ორივე სიტყვის სიგრძეების ჯამი მეტია 12-ზე
// და პირველი სიტყვა uppercase-ში არ უდრის მეორეს uppercase-ში
// დაბეჭდე "Different long words"

// სხვა შემთხვევაში → "Failed"

// 5)მომხმარებელს შემოატანინე ქვეყანა.
// თუ:
// ტექსტი uppercase-ში უდრის "GEORGIA"
// ან lowercase-ში უდრის "sakartvelo"
// დაბეჭდე "Correct country"
// სხვა შემთხვევაში → "Unknown country"

// 6)
// მომხმარებელს შემოატანინე password.
// თუ:
// length არის 8-დან 15-მდე
// და იწყება uppercase ასოთი


// დაბეჭდე "Good password"
// სხვა შემთხვევაში → "Bad password"

// 7)მომხმარებელს შემოატანინე ტექსტი.
// თუ:
// ტექსტის length ლუწია
// და lowercase ტექსტი არ იწყება "x"-ზე
// და uppercase ტექსტი არ უდრის ორიგინალს

// დაბეჭდე "Accepted"
// სხვა შემთხვევაში → "Rejected"

// 8)მომხმარებელს შემოატანინე ორი username.
// თუ:
// ორივე იწყება "go"-თი
// და ერთნაირი არ არის(!==)
// და ორივეს length მინიმუმ 6 აქვს

// დაბეჭდე "Matching users"
// სხვა შემთხვევაში → "Users failed"

// 9)მომხმარებელს შემოატანინე 2 პაროლი.
// თუ:
// ორივე პაროლი ერთმანეთს ემთხვევა
// და პირველი პაროლის length მეტია 8-ზე
// და პაროლი uppercase-ში არ უდრის ორიგინალს

// დაბეჭდე "Passwords match"
// სხვა შემთხვევაში → "Passwords do not match"

// 10)მომხმარებელს შემოატანინე ტექსტი.
// თუ:
// ტექსტი იწყება "java"-თი 
// ან length მეტია 20-ზე
// დაბეჭდე "Programming text"


// თუ length ნაკლებია 5-ზე → "Too short"

// სხვა შემთხვევაში → "Unknown text"